In [36]:
import mysql.connector as conn
data = conn.connect(
user = 'root',
password ='Assie@225',
host = 'localhost',
port =3306,    
database ='employees',
auth_plugin='mysql_native_password'    
    
)

In [3]:
my_cursor = data.cursor()

In [15]:
my_cursor.execute('SHOW TABLES')

In [16]:
for x in my_cursor:
    print(x)

(bytearray(b'current_dept_emp'),)
(bytearray(b'departments'),)
(bytearray(b'dept_emp'),)
(bytearray(b'dept_emp_latest_date'),)
(bytearray(b'dept_manager'),)
(bytearray(b'employees'),)
(bytearray(b'salaries'),)
(bytearray(b'titles'),)

In [21]:
my_cursor.execute('SELECT *FROM departments')

In [18]:
for x in my_cursor:
    print(x)
    print('----'*3)

('d009', 'Customer Service')
------------
('d005', 'Development')
------------
('d002', 'Finance')
------------
('d003', 'Human Resources')
------------
('d001', 'Marketing')
------------
('d004', 'Production')
------------
('d006', 'Quality Management')
------------
('d008', 'Research')
------------
('d007', 'Sales')
------------

In [22]:
data = []
for x in my_cursor:
    data.append(x)

In [23]:
data

[('d009', 'Customer Service'),
 ('d005', 'Development'),
 ('d002', 'Finance'),
 ('d003', 'Human Resources'),
 ('d001', 'Marketing'),
 ('d004', 'Production'),
 ('d006', 'Quality Management'),
 ('d008', 'Research'),
 ('d007', 'Sales')]

In [24]:
data[1]

('d005', 'Development')

In [25]:
data1 = []
for x in data:
    data1.append(list(x))

In [26]:
data1

[['d009', 'Customer Service'],
 ['d005', 'Development'],
 ['d002', 'Finance'],
 ['d003', 'Human Resources'],
 ['d001', 'Marketing'],
 ['d004', 'Production'],
 ['d006', 'Quality Management'],
 ['d008', 'Research'],
 ['d007', 'Sales']]

In [29]:
data1[0][1] = 'vendor'

In [30]:
data1

[['d009', 'vendor'],
 ['d005', 'Development'],
 ['d002', 'Finance'],
 ['d003', 'Human Resources'],
 ['d001', 'Marketing'],
 ['d004', 'Production'],
 ['d006', 'Quality Management'],
 ['d008', 'Research'],
 ['d007', 'Sales']]

In [31]:
data2 =[]
for x in data1:
    data2.append(tuple(x))

In [32]:
data2

[('d009', 'vendor'),
 ('d005', 'Development'),
 ('d002', 'Finance'),
 ('d003', 'Human Resources'),
 ('d001', 'Marketing'),
 ('d004', 'Production'),
 ('d006', 'Quality Management'),
 ('d008', 'Research'),
 ('d007', 'Sales')]

In [33]:
data

[('d009', 'Customer Service'),
 ('d005', 'Development'),
 ('d002', 'Finance'),
 ('d003', 'Human Resources'),
 ('d001', 'Marketing'),
 ('d004', 'Production'),
 ('d006', 'Quality Management'),
 ('d008', 'Research'),
 ('d007', 'Sales')]

In [37]:
import pandas as pd
import numpy as np

In [39]:
t_data = pd.read_sql_query('SELECT *FROM employees',data)

In [40]:
t_data

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [41]:
t_data['hire_date']

0         1986-06-26
1         1985-11-21
2         1986-08-28
3         1986-12-01
4         1989-09-12
             ...
300019    1993-01-12
300020    1990-09-27
300021    1986-04-21
300022    1993-10-13
300023    1997-11-30
Name: hire_date, Length: 300024, dtype: object

In [47]:
t_data['emp_no'].sum()

76002608740

## The way to create a database

In [48]:
import mysql.connector as conn
db = conn.connect(
user = 'root',
password ='Assie@225',
host = 'localhost',
port =3306,    
auth_plugin='mysql_native_password'    
    
)

In [51]:
my_cursor = db.cursor()

In [53]:
my_cursor.execute('CREATE DATABASE shop_database')

In [57]:
my_cursor.execute("SHOW DATABASES",db)

In [58]:
for x in my_cursor:
    print(x)
    print("_____"*3)

(bytearray(b'employees'),)
_______________
(bytearray(b'information_schema'),)
_______________
(bytearray(b'mydata'),)
_______________
(bytearray(b'mysql'),)
_______________
(bytearray(b'performance_schema'),)
_______________
(bytearray(b'shop_database'),)
_______________
(bytearray(b'sys'),)
_______________

## How to connect the database I just created.

In [59]:
import mysql.connector as conn
db = conn.connect(
user = 'root',
password ='Assie@225',
host = 'localhost',
port =3306, 
database ='shop_database',    
auth_plugin='mysql_native_password'    
    
)

In [60]:
my_cursor = db.cursor()

## How to create a table the new database

In [63]:
my_cursor.execute("CREATE TABLE phone(phone_id INT(4), phone_name VARCHAR(45), phone_brand VARCHAR(45), phone_price INT(8))")

In [77]:
my_cursor.execute('DESCRIBE phone')

## How to display the structure of our table`

In [78]:
for x in my_cursor:
    print(x)
    print('----'*5)

('phone_id', b'int', 'YES', bytearray(b''), None, '')
--------------------
('phone_name', b'varchar(45)', 'YES', bytearray(b''), None, '')
--------------------
('phone_brand', b'varchar(45)', 'YES', bytearray(b''), None, '')
--------------------
('phone_price', b'int', 'YES', bytearray(b''), None, '')
--------------------

## How insert a single row (record) into our table.

In [81]:
sql = "INSERT INTO phone (phone_id,phone_name,phone_brand,phone_price) VALUES(100,'Iphone12','Iphone',25000)"

In [82]:
my_cursor.execute(sql)

In [83]:
db.commit()

## How insert a multible  rows (records) into our table.

In [86]:
sql2 = "INSERT INTO phone (phone_id,phone_name,phone_brand,phone_price)\
VALUES (101,'Iphone 12 Pro','Iphone',25000),\
(102,'vivo v20','Vivo',27000),\
(103,'Samsung S17','Samsung',56000),\
(104,'Oppo A12','Oppo',29000),\
(105,'Airtel F1','Airtel',28000),\
(106,'Nokia Q2','Nokia',27000),\
(107,'Alcatel G4','Alcatel',28000),\
(108,'Teckno P1','Teckno',66000),\
(109,'Iphone 13','Iphone',77000),\
(110,'Samsung S20','Samsung',67000)"

In [87]:
my_cursor.execute(sql2)
db.commit()

In [88]:
sql = "SELECT *FROM phone"

In [89]:
my_cursor.execute(sql)
for x in my_cursor:
    print(x)
    print('--'*4)

(100, 'Iphone12', 'Iphone', 25000)
--------
(101, 'Iphone 12 Pro', 'Iphone', 25000)
--------
(102, 'vivo v20', 'Vivo', 27000)
--------
(103, 'Samsung S17', 'Samsung', 56000)
--------
(104, 'Oppo A12', 'Oppo', 29000)
--------
(105, 'Airtel F1', 'Airtel', 28000)
--------
(106, 'Nokia Q2', 'Nokia', 27000)
--------
(107, 'Alcatel G4', 'Alcatel', 28000)
--------
(108, 'Teckno P1', 'Teckno', 66000)
--------
(109, 'Iphone 13', 'Iphone', 77000)
--------
(110, 'Samsung S20', 'Samsung', 67000)
--------

In [90]:
import pandas as pd 
import numpy as np

In [92]:
data = pd.read_sql_query("SELECT *FROM phone",db)

In [93]:
data

    phone_id     phone_name phone_brand  phone_price
0        100       Iphone12      Iphone        25000
1        101  Iphone 12 Pro      Iphone        25000
2        102       vivo v20        Vivo        27000
3        103    Samsung S17     Samsung        56000
4        104       Oppo A12        Oppo        29000
5        105      Airtel F1      Airtel        28000
6        106       Nokia Q2       Nokia        27000
7        107     Alcatel G4     Alcatel        28000
8        108      Teckno P1      Teckno        66000
9        109      Iphone 13      Iphone        77000
10       110    Samsung S20     Samsung        67000

## Another way to insert multiple records. __Using executemay()__ method.

In [95]:
sql = "INSERT INTO phone (phone_id,phone_name,phone_brand,phone_price) VALUES(%s, %s, %s, %s)"
value = (
(1011,'vivo v20','Vivo',27000),
(1012,'Samsung S17','Samsung',56000),
(1013,'Oppo A12','Oppo',29000),
(1014,'Airtel F1','Airtel',28000),
(1015,'Nokia Q2','Nokia',27000),
(1016,'Alcatel G4','Alcatel',28000),
(1017,'Teckno P1','Teckno',66000),
(1018,'Iphone 13','Iphone',77000),
(119,'Samsung S20','Samsung',67000))
my_cursor.executemany(sql,value)
db.commit()

In [96]:
data = pd.read_sql_query("SELECT *FROM phone",db)

In [97]:
data

    phone_id     phone_name phone_brand  phone_price
0        100       Iphone12      Iphone        25000
1        101  Iphone 12 Pro      Iphone        25000
2        102       vivo v20        Vivo        27000
3        103    Samsung S17     Samsung        56000
4        104       Oppo A12        Oppo        29000
5        105      Airtel F1      Airtel        28000
6        106       Nokia Q2       Nokia        27000
7        107     Alcatel G4     Alcatel        28000
8        108      Teckno P1      Teckno        66000
9        109      Iphone 13      Iphone        77000
10       110    Samsung S20     Samsung        67000
11      1011       vivo v20        Vivo        27000
12      1012    Samsung S17     Samsung        56000
13      1013       Oppo A12        Oppo        29000
14      1014      Airtel F1      Airtel        28000
15      1015       Nokia Q2       Nokia        27000
16      1016     Alcatel G4     Alcatel        28000
17      1017      Teckno P1      Teckno        66000
18      1018      Iphone 13      Iphone        77000
19       119    Samsung S20     Samsung        67000